app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

SELECT "users".* FROM "users"
---
  def new
    @order = Order.new
    @users = User.all

INSERT INTO "orders" ("total", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["total", 5], ["user_id", 1], ["created_at", "2018-03-15 22:44:48.441551"], ["updated_at", "2018-03-15 22:44:48.441551"]]
---
  def create
    @order = Order.new(order_params)
    @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:id])