app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Charles"], ["last_name", "Joshua"], ["age", 25], ["created_at", "2018-03-15 22:44:35.595882"], ["updated_at", "2018-03-15 22:44:35.595882"]]

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]